Revit 2027 API
ElectricalSetting.SetSpecificFittingAngleStatus Method
 Sets the status of given specific angle.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSpecificFittingAngleStatus(
	double angle,
	bool bStatus
)
Public Sub SetSpecificFittingAngleStatus (
	angle As Double,
	bStatus As Boolean
)
public:
void SetSpecificFittingAngleStatus(
	double angle,
	bool bStatus
)
member SetSpecificFittingAngleStatus :
        angle : float *
        bStatus : bool -> unit
Parameters
angle Double
 The specific angle (in degree) that must be 60, 45, 30, 22.5 or 11.25 degrees.
bStatus Boolean
 Status, true - using the given angle during the pipe layout.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
InvalidOperationException |  Can not set an angle status for an invalid angle.
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace